#### 🏗️ Infrastructure Terraform Plan

**Status:** `success`

<details><summary>📋 Show Plan</summary>

```terraform
aws_cloudwatch_dashboard.main: Refreshing state... [id=TechChallenge-Dashboard]
aws_ecr_repository.customer: Refreshing state... [id=tech-challenge-customer]
aws_cloudwatch_log_group.orders_service: Refreshing state... [id=/tech-challenge/orders-service]
aws_cloudwatch_log_group.applications: Refreshing state... [id=/tech-challenge/applications]
aws_vpc.main: Refreshing state... [id=vpc-039652291583dd228]
aws_cloudwatch_log_group.customer_service: Refreshing state... [id=/tech-challenge/customer-service]
aws_cloudwatch_log_group.eks_cluster: Refreshing state... [id=/aws/eks/tech-challenge-cluster/cluster]
aws_cloudwatch_log_group.payments_service: Refreshing state... [id=/tech-challenge/payments-service]
aws_cloudwatch_metric_alarm.high_memory: Refreshing state... [id=tech-challenge-high-memory]
aws_ecr_repository.payments: Refreshing state... [id=tech-challenge-payments]
aws_cloudwatch_metric_alarm.high_cpu: Refreshing state... [id=tech-challenge-high-cpu]
aws_ecr_repository.orders: Refreshing state... [id=tech-challenge-orders]
data.aws_caller_identity.current: Reading...
aws_cognito_user_pool.main: Refreshing state... [id=us-east-1_DJ8Qwuxv1]
data.aws_iam_role.lab_role: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=392932881523]
aws_ecr_lifecycle_policy.payments: Refreshing state... [id=tech-challenge-payments]
aws_ecr_lifecycle_policy.orders: Refreshing state... [id=tech-challenge-orders]
aws_ecr_lifecycle_policy.customer: Refreshing state... [id=tech-challenge-customer]
data.aws_iam_role.lab_role: Read complete after 1s [id=LabRole]
aws_cognito_user_pool_domain.main: Refreshing state... [id=tech-challenge-392932881523]
aws_cognito_user_pool_client.main: Refreshing state... [id=5luin4msh5ecfc6pggmfose5jf]
aws_security_group.eks_cluster: Refreshing state... [id=sg-0b5218e81b0b6e5a1]
aws_security_group.nlb: Refreshing state... [id=sg-00de3eaba69f0e25b]
aws_subnet.public[0]: Refreshing state... [id=subnet-0fe497fd9b3e23186]
aws_subnet.private[0]: Refreshing state... [id=subnet-04919e7d630198bb3]
aws_subnet.private[1]: Refreshing state... [id=subnet-0f6016b3395182462]
aws_internet_gateway.main: Refreshing state... [id=igw-05c8e4f86d545e389]
aws_subnet.public[1]: Refreshing state... [id=subnet-0bc13f775d100e997]
aws_lb_target_group.nginx_ingress: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:392932881523:targetgroup/tech-challenge-nginx-tg/3df9579e2ab1ce0c]
aws_eip.nat: Refreshing state... [id=eipalloc-0af42764a2667776c]
aws_route_table.public: Refreshing state... [id=rtb-0dc90a060d4d32936]
aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:392932881523:loadbalancer/net/tech-challenge-nlb/8d96ea269ae4b4ea]
aws_eks_cluster.main: Refreshing state... [id=tech-challenge-cluster]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0672ca811f6f806c6]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0d775878084c47306]
aws_nat_gateway.main: Refreshing state... [id=nat-08d0dad7802c92c1b]
aws_route_table.private: Refreshing state... [id=rtb-03935fda623b1b8e8]
aws_eks_node_group.main: Refreshing state... [id=tech-challenge-cluster:tech-challenge-node-group]
kubernetes_ingress_class.nginx: Refreshing state... [id=nginx]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0b762ee920dd88d53]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ae9ddc470903b28b]
kubernetes_cluster_role.ingress_nginx: Refreshing state... [id=ingress-nginx]
kubernetes_namespace.ingress_nginx: Refreshing state... [id=ingress-nginx]
aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:392932881523:listener/net/tech-challenge-nlb/8d96ea269ae4b4ea/2a541d7f7c41064d]
aws_eks_addon.vpc_cni: Refreshing state... [id=tech-challenge-cluster:vpc-cni]
kubernetes_namespace.tech_challenge: Refreshing state... [id=tech-challenge]
aws_eks_addon.coredns: Refreshing state... [id=tech-challenge-cluster:coredns]
aws_eks_addon.cloudwatch_observability: Refreshing state... [id=tech-challenge-cluster:amazon-cloudwatch-observability]
aws_eks_addon.kube_proxy: Refreshing state... [id=tech-challenge-cluster:kube-proxy]
kubernetes_service_account.ingress_nginx: Refreshing state... [id=ingress-nginx/ingress-nginx]
kubernetes_service.ingress_nginx_controller: Refreshing state... [id=ingress-nginx/ingress-nginx-controller]
kubernetes_role.ingress_nginx: Refreshing state... [id=ingress-nginx/ingress-nginx]
kubernetes_config_map.ingress_nginx: Refreshing state... [id=ingress-nginx/ingress-nginx-controller]
kubernetes_cluster_role_binding.ingress_nginx: Refreshing state... [id=ingress-nginx]
kubernetes_role_binding.ingress_nginx: Refreshing state... [id=ingress-nginx/ingress-nginx]
kubernetes_deployment.ingress_nginx_controller: Refreshing state... [id=ingress-nginx/ingress-nginx-controller]
kubernetes_ingress_v1.tech_challenge: Refreshing state... [id=tech-challenge/tech-challenge-ingress]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_dashboard.main will be updated in-place
  ~ resource "aws_cloudwatch_dashboard" "main" {
      ~ dashboard_body = jsonencode(
          ~ {
              ~ widgets = [
                    # (6 unchanged elements hidden)
                    {
                        height     = 6
                        properties = {
                            metrics = [
                                [
                                    "ContainerInsights",
                                    "pod_memory_utilization",
                                    "ClusterName",
                                    "tech-challenge-cluster",
                                    "Namespace",
                                    "tech-challenge",
                                    {
                                        period = 300
                                        stat   = "Average"
                                    },
                                ],
                            ]
                            region  = "us-east-1"
                            title   = "💾 Memória Pods tech-challenge"
                            view    = "timeSeries"
                        }
                        type       = "metric"
                        width      = 8
                        x          = 16
                        y          = 9
                    },
                  ~ {
                      ~ properties = {
                          ~ query  = "SOURCE '/tech-challenge/applications' | fields @timestamp, @message | sort @timestamp desc | limit 50" -> "SOURCE '/aws/containerinsights/tech-challenge-cluster/application' | fields @timestamp, @message, kubernetes.container_name | filter kubernetes.namespace_name = 'tech-challenge' | sort @timestamp desc | limit 50"
                            # (2 unchanged attributes hidden)
                        }
                        # (5 unchanged attributes hidden)
                    },
                    {
                        height     = 6
                        properties = {
                            metrics = [
                                [
                                    "ContainerInsights",
                                    "node_network_total_bytes",
                                    "ClusterName",
                                    "tech-challenge-cluster",
                                    {
                                        period = 300
                                        stat   = "Sum"
                                    },
                                ],
                            ]
                            region  = "us-east-1"
                            title   = "🌐 Tráfego de Rede (bytes)"
                            view    = "timeSeries"
                        }
                        type       = "metric"
                        width      = 12
                        x          = 0
                        y          = 21
                    },
                    # (1 unchanged element hidden)
                ]
            }
        )
        id             = "TechChallenge-Dashboard"
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.applications will be destroyed
  # (because aws_cloudwatch_log_group.applications is not in configuration)
  - resource "aws_cloudwatch_log_group" "applications" {
      - arn                         = "arn:aws:logs:us-east-1:392932881523:log-group:/tech-challenge/applications" -> null
      - deletion_protection_enabled = false -> null
      - id                          = "/tech-challenge/applications" -> null
      - log_group_class             = "STANDARD" -> null
      - name                        = "/tech-challenge/applications" -> null
      - region                      = "us-east-1" -> null
      - retention_in_days           = 7 -> null
      - skip_destroy                = false -> null
      - tags                        = {
          - "Environment" = "production"
          - "Name"        = "tech-challenge-app-logs"
        } -> null
      - tags_all                    = {
          - "Environment" = "production"
          - "ManagedBy"   = "Terraform"
          - "Name"        = "tech-challenge-app-logs"
          - "Project"     = "TechChallenge"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.container_insights_application will be created
  + resource "aws_cloudwatch_log_group" "container_insights_application" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/containerinsights/tech-challenge-cluster/application"
      + name_prefix                 = (known after apply)
      + region                      = "us-east-1"
      + retention_in_days           = 7
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "production"
          + "Name"        = "tech-challenge-container-insights-app"
          + "Source"      = "container-insights"
        }
      + tags_all                    = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "tech-challenge-container-insights-app"
          + "Project"     = "TechChallenge"
          + "Source"      = "container-insights"
        }
    }

  # aws_cloudwatch_log_group.container_insights_dataplane will be created
  + resource "aws_cloudwatch_log_group" "container_insights_dataplane" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/containerinsights/tech-challenge-cluster/dataplane"
      + name_prefix                 = (known after apply)
      + region                      = "us-east-1"
      + retention_in_days           = 7
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "production"
          + "Name"        = "tech-challenge-container-insights-dataplane"
          + "Source"      = "container-insights"
        }
      + tags_all                    = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "tech-challenge-container-insights-dataplane"
          + "Project"     = "TechChallenge"
          + "Source"      = "container-insights"
        }
    }

  # aws_cloudwatch_log_group.container_insights_host will be created
  + resource "aws_cloudwatch_log_group" "container_insights_host" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/containerinsights/tech-challenge-cluster/host"
      + name_prefix                 = (known after apply)
      + region                      = "us-east-1"
      + retention_in_days           = 7
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "production"
          + "Name"        = "tech-challenge-container-insights-host"
          + "Source"      = "container-insights"
        }
      + tags_all                    = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "tech-challenge-container-insights-host"
          + "Project"     = "TechChallenge"
          + "Source"      = "container-insights"
        }
    }

  # aws_cloudwatch_log_group.container_insights_performance will be created
  + resource "aws_cloudwatch_log_group" "container_insights_performance" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/containerinsights/tech-challenge-cluster/performance"
      + name_prefix                 = (known after apply)
      + region                      = "us-east-1"
      + retention_in_days           = 7
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "production"
          + "Name"        = "tech-challenge-container-insights-performance"
          + "Source"      = "container-insights"
        }
      + tags_all                    = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "tech-challenge-container-insights-performance"
          + "Project"     = "TechChallenge"
          + "Source"      = "container-insights"
        }
    }

  # aws_cloudwatch_log_group.customer_service will be destroyed
  # (because aws_cloudwatch_log_group.customer_service is not in configuration)
  - resource "aws_cloudwatch_log_group" "customer_service" {
      - arn                         = "arn:aws:logs:us-east-1:392932881523:log-group:/tech-challenge/customer-service" -> null
      - deletion_protection_enabled = false -> null
      - id                          = "/tech-challenge/customer-service" -> null
      - log_group_class             = "STANDARD" -> null
      - name                        = "/tech-challenge/customer-service" -> null
      - region                      = "us-east-1" -> null
      - retention_in_days           = 7 -> null
      - skip_destroy                = false -> null
      - tags                        = {
          - "Name"    = "customer-service-logs"
          - "Service" = "customer"
        } -> null
      - tags_all                    = {
          - "Environment" = "production"
          - "ManagedBy"   = "Terraform"
          - "Name"        = "customer-service-logs"
          - "Project"     = "TechChallenge"
          - "Service"     = "customer"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.orders_service will be destroyed
  # (because aws_cloudwatch_log_group.orders_service is not in configuration)
  - resource "aws_cloudwatch_log_group" "orders_service" {
      - arn                         = "arn:aws:logs:us-east-1:392932881523:log-group:/tech-challenge/orders-service" -> null
      - deletion_protection_enabled = false -> null
      - id                          = "/tech-challenge/orders-service" -> null
      - log_group_class             = "STANDARD" -> null
      - name                        = "/tech-challenge/orders-service" -> null
      - region                      = "us-east-1" -> null
      - retention_in_days           = 7 -> null
      - skip_destroy                = false -> null
      - tags                        = {
          - "Name"    = "orders-service-logs"
          - "Service" = "orders"
        } -> null
      - tags_all                    = {
          - "Environment" = "production"
          - "ManagedBy"   = "Terraform"
          - "Name"        = "orders-service-logs"
          - "Project"     = "TechChallenge"
          - "Service"     = "orders"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.payments_service will be destroyed
  # (because aws_cloudwatch_log_group.payments_service is not in configuration)
  - resource "aws_cloudwatch_log_group" "payments_service" {
      - arn                         = "arn:aws:logs:us-east-1:392932881523:log-group:/tech-challenge/payments-service" -> null
      - deletion_protection_enabled = false -> null
      - id                          = "/tech-challenge/payments-service" -> null
      - log_group_class             = "STANDARD" -> null
      - name                        = "/tech-challenge/payments-service" -> null
      - region                      = "us-east-1" -> null
      - retention_in_days           = 7 -> null
      - skip_destroy                = false -> null
      - tags                        = {
          - "Name"    = "payments-service-logs"
          - "Service" = "payments"
        } -> null
      - tags_all                    = {
          - "Environment" = "production"
          - "ManagedBy"   = "Terraform"
          - "Name"        = "payments-service-logs"
          - "Project"     = "TechChallenge"
          - "Service"     = "payments"
        } -> null
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 4 to destroy.

Changes to Outputs:
  ~ cloudwatch_log_group_apps        = "/tech-challenge/applications" -> "/aws/containerinsights/tech-challenge-cluster/application"
  + cloudwatch_log_group_performance = "/aws/containerinsights/tech-challenge-cluster/performance"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

---
*Triggered by: @TheMyFish via `pull_request`*